tutorial/lagrangian/icoMesoScaleCouplingFoam/spoutBedMakeInitial/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue voidFraction 1
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.1 0.1 0.05);
        fieldValues
        (
            volScalarFieldValue voidFraction 1
        );
    }
);


// ************************************************************************* //
